import requests
import time

url = 'http://5.23.55.214:8000/localityadd/'
# url = 'http://127.0.0.1:8000/localityadd/'

names = ['Аур',
         'Белгородское',
         'Биракан',
         'Биробиджан‎',
         'Владимировка',
         'Волочаевка',
         'Даниловка',
         'Дежневка',
         'Известковый',
         'Икура',
         'им. Тельмана',
         'Камышовка',
         'Ключевое',
         'Кульдур',
         'Луговое',
         'Нижнеспасское',
         'Николаевка',
         'Облучье',
         'Оль',
         'Ольгохта',
         'Осиновка',
         'Партизанское',
         'Пашково',
         'Песчаное',
         'Петровское',
         'Приамурский',
         'Смидович',
         'Соцгородок',
         'Теплоозерск',
         'Усов Балаган',
         'Хинганск',
         ]

name = ''
for name in names:
    data = ({"name": name, "region": 3})
    res = requests.post(url, json=data)
    time.sleep(1)
